app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1"], ["description", "1234567"], ["category_id", 1], ["created_at", "2023-01-17 01:31:05.903695"], ["updated_at", "2023-01-17 01:31:05.903695"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "sorry ;-)"], ["updated_at", "2023-01-16 23:26:23.626893"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)