app/controllers/operations_controller.rb

  def index
    @operations = Operation.all
---
SELECT "operations".* FROM "operations"

  def create
    @operation = Operation.new(operation_params)

    respond_to do |format|
      if @operation.save
---
INSERT INTO "operations" ("amount", "odate", "description", "category_id", "operation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_operation
      @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]